Autodesk.Revit.DB.RenderingQualitySettings.RenderingQuality
The quality applied for rendering.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.AreCurtainWallsDaylightPortals
Indicates whether curtain walls daylight portals.
Remarks:
Set this property to true when sunlighting coming through a curtain wall looks splotchy, this can slow down rendering but helps for rooms with few places for sunlight to enter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.AreDoorsDaylightPortals
Indicates whether doors daylight portals.
Remarks:
Set this property to true when sunlighting coming through a door looks splotchy, this can slow down rendering but helps for rooms with few places for sunlight to enter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.AreWindowsDaylightPortals
Indicates whether windows daylight portals.
Remarks:
Set this property to true when sunlighting coming through windows looks splotchy, this can slow down rendering but helps for rooms with few or small windows.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.IndirectIlluminationBounces
The indirect illumination bounces value.
Remarks:
Increase this value when areas of the scene that should be indirectly illuminated are left in darkness.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The indirect illumination bounces value is not valid. The valid range is 1 to 5.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
-or-
When setting this property: Should not compute indirect and sky illumination.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.IndirectIlluminationSmoothness
The  indirect illumination smoothness value.
Remarks:
Increase this value when the indirect illumination looks splotchy or scaly.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The indirect illumination smoothness value is not valid. The valid range is 1 to 10.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
-or-
When setting this property: Should not compute indirect and sky illumination.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.IndirectIlluminationPrecision
The indirect illumination precision value.
Remarks:
Increase this value to get more detailed indirect illumination and shadows.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The indirect illumination precision value is not valid. The valid range is 1 to 10.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
-or-
When setting this property: Should not compute indirect and sky illumination.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.ShouldComputeIndirectAndSkyIllumination
Indicates whether to include light that bounces off other objects, and light from the sky when calculating the lighting for this scene.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.SoftShadowsPrecision
The soft shadows precision value.
Remarks:
Increase this value when the edges of soft shadows appear to be speckled, rather than smoothly blurred.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The soft shadows precision value is not valid. The valid range is 1 to 10.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
-or-
When setting this property: Shadows are not enabled.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.AreShadowsEnabled
Indicates whether to make shadow edges soft(blurred).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.BlurredRefractionPrecision
The blurred refractions precision.
Remarks:
Increase this value when the edges of objects seen through rough glass are speckled, rather than smoothly blurred.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The blurred refractions precision is not valid. The valid range is 1 to 11.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.BlurredReflectionPrecision
The blurred reflections precision.
Remarks:
Increase this value when the edges of objects in blurred reflections are speckled, rather than smoothly blurred.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The blurred reflections precision is not valid. The valid range is 1 to 11.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.MaxRefractions
The maximum number of refractions.
Remarks:
Increase this value when you can not see objects through multiple panes of glass.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The maximum number of refractions is not valid. The valid range is 0 to 100.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.MaxReflections
The maximum number of reflections.
Remarks:
Increase this value when objects are missing from reflections.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The maximum number of reflections is not valid. The valid range is 0 to 100.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings.ImagePrecision
A value that controls how antialiasing is applied to the background image.
Remarks:
Increase this value to smooth out jagged edges in the rendering.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The image precision value is not valid. The valid range is 0 to 10.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2013

Autodesk.Revit.DB.RenderingQualitySettings
Represents the quality settings of rendering.
Remarks:
The other properties in this class can only be modified if the RenderingQuality property is currently set to Custom.
Since:
2013